app/controllers/disks_controller.rb

SELECT * FROM [disks]
---
  def index
    @disks = Disk.all

SELECT * FROM [disks] WHERE ([disks].[id] = 1)
---
  def show
    @disk = Disk.find(params[:id])

SELECT * FROM [disks] WHERE ([disks].[id] = 8)
---
  def edit
    @disk = Disk.find(params[:id])

INSERT INTO [disks] ([image], [name], [is_movie], [season], [first_episode], [first_title], [created_at], [updated_at]) VALUES('blabla.iso', 'blabla', 1, 1, 1, 1, '2010-03-20 06:09:32.782', '2010-03-20 06:09:32.782')
---
  def create
    @disk = Disk.new(params[:disk])

    respond_to do |format|
      if @disk.save

SELECT * FROM [disks] WHERE ([disks].[id] = 8)
UPDATE [disks] SET [season] = 1, [first_episode] = 23, [first_title] = 41, [updated_at] = '2010-03-20 09:03:11.376' WHERE [id] = 9
---
  def update
    @disk = Disk.find(params[:id])

    respond_to do |format|
      if @disk.update_attributes(params[:disk])

SELECT * FROM [disks] WHERE ([disks].[id] = 2)
DELETE FROM [disks] WHERE [id] = 2
---
  def destroy
    @disk = Disk.find(params[:id])
    @disk.destroy